# Обработка данных временных рядов
импортировать  numpy  как  np
import  matplotlib . pyplot  как  plt
импортировать  панды  как  pd  # импорт библиотек

# Считывание исходника
def  read_data ( входной_файл ):
    input_data  =  np . loadtxt ( входной_файл , разделитель  =  Нет )
    даты  =  pd . DATE_RANGE ( '1950-01' , периоды  =  input_data . форма [ 0 ], частота  =  'М' ) # Преобразование данных во временные ряды
    вывод  =  pd . Серия ( input_data [:, даты ], индекс  =  дата ) # создание врет. рядов
    возвратный  вывод


if  __name__ == '__main__' : # Путь файла
    input_file  =  "/QQQ/pr/wow.txt"
    таймсерия  =  read_data ( входной_файл ) # преобразование столбец

    # Визуал данных
    plt . рисунок ()
    таймсерии . сюжет ()
    plt . показать ()
